Results/Trino/trinoDelta/trinoDelta-ycsba-run-1.txt
[WARN]  Running against a source checkout. In order to get our runtime dependencies we'll have to invoke Maven. Depending on the state of your system, this may take ~30-45 seconds
[DEBUG]  Running 'mvn -pl site.ycsb:jdbc-binding -am package -DskipTests dependency:build-classpath -DincludeScope=compile -Dmdep.outputFilterFile=true'
java -cp jdbc/lib/trino-jdbc-481.jar:/LakeVilla/YCSB-LH/jdbc/conf:/LakeVilla/YCSB-LH/jdbc/target/jdbc-binding-0.18.0-SNAPSHOT.jar:/.m2/repository/org/apache/geronimo/specs/geronimo-jta_1.1_spec/1.1.1/geronimo-jta_1.1_spec-1.1.1.jar:/.m2/repository/org/apache/htrace/htrace-core4/4.1.0-incubating/htrace-core4-4.1.0-incubating.jar:/.m2/repository/net/sourceforge/serp/serp/1.13.1/serp-1.13.1.jar:/.m2/repository/org/hdrhistogram/HdrHistogram/2.1.4/HdrHistogram-2.1.4.jar:/.m2/repository/org/apache/openjpa/openjpa-jdbc/2.1.1/openjpa-jdbc-2.1.1.jar:/.m2/repository/org/apache/geronimo/specs/geronimo-jms_1.1_spec/1.1.1/geronimo-jms_1.1_spec-1.1.1.jar:/.m2/repository/org/apache/openjpa/openjpa-kernel/2.1.1/openjpa-kernel-2.1.1.jar:/.m2/repository/org/codehaus/jackson/jackson-core-asl/1.9.4/jackson-core-asl-1.9.4.jar:/LakeVilla/YCSB-LH/core/target/core-0.18.0-SNAPSHOT.jar:/.m2/repository/commons-collections/commons-collections/3.2.1/commons-collections-3.2.1.jar:/.m2/repository/commons-lang/commons-lang/2.4/commons-lang-2.4.jar:/.m2/repository/org/codehaus/jackson/jackson-mapper-asl/1.9.4/jackson-mapper-asl-1.9.4.jar:/.m2/repository/org/apache/openjpa/openjpa-lib/2.1.1/openjpa-lib-2.1.1.jar:/.m2/repository/commons-pool/commons-pool/1.5.4/commons-pool-1.5.4.jar site.ycsb.Client -db site.ycsb.db.JdbcDBClient -P workloads/workloada -P jdbc/config/trino.properties -t
Command line: -db site.ycsb.db.JdbcDBClient -P workloads/workloada -P jdbc/config/trino.properties -t
YCSB Client 0.18.0-SNAPSHOT
Loading workload...
Starting test.
Adding shard node URL: jdbc:trino://localhost:8080/delta/default
Using shards: 1, batchSize:-1, fetchSize: -1
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
[OVERALL], RunTime(ms), 621994
[OVERALL], Throughput(ops/sec), 1.6077325504747635
[TOTAL_GCS_G1_Young_Generation], Count, 4
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 47
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.007556342987231388
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 4
[TOTAL_GC_TIME], Time(ms), 47
[TOTAL_GC_TIME_%], Time(%), 0.007556342987231388
[READ], Operations, 509
[READ], AverageLatency(us), 414979.1434184676
[READ], MinLatency(us), 239232
[READ], MaxLatency(us), 4575231
[READ], 95thPercentileLatency(us), 550911
[READ], 99thPercentileLatency(us), 1045503
[READ], Return=OK, 509
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 1058.0
[CLEANUP], MinLatency(us), 1058
[CLEANUP], MaxLatency(us), 1058
[CLEANUP], 95thPercentileLatency(us), 1058
[CLEANUP], 99thPercentileLatency(us), 1058
[UPDATE], Operations, 491
[UPDATE], AverageLatency(us), 835853.816700611
[UPDATE], MinLatency(us), 489728
[UPDATE], MaxLatency(us), 4870143
[UPDATE], 95thPercentileLatency(us), 1856511
[UPDATE], 99thPercentileLatency(us), 2062335
[UPDATE], Return=OK, 491